app/controllers/analyzer_controller.rb

   	def historic_data

        stock_data = StockHistoricData.all
---
SELECT `stock_historic_data`.* FROM `stock_historic_data`

    def predicted_data
        prediction = Prediction_Data.where("stock_tickers =?", params[:tick])
---
SELECT `prediction_data`.* FROM `prediction_data` WHERE `prediction_data`.`stock_tickers` IS NULL