app/controllers/analyzer_controller.rb

  def centralAnalysis

  	@stdout, @stdeerr, status = Open3.capture3("python app/assets/pythonScripts/dataPull.py " + params[:id] )
  	$ticker = params[:id]
    @stdout1, @stdeerr1, status1= Open3.capture3("python app/assets/pythonScripts/patternRecognition.py "+ params[:id] )


    if session[:PID] == nil
      @pid = Process.spawn("python app/assets/pythonScripts/twitter.py "+ params[:id]  )
      process_id @pid
      current_tick $ticker
    else
      if  session[:ticker] != params[:id]
        begin
            Process.kill "TERM", session[:PID]
        rescue Errno::ESRCH
            false
        end
         deletePid
      end

    end
    @tweets = TwitterStream.where("stock_name =?", $ticker)#.order("updated_at DESC")
    @fb = FbStream.where("stock_name =?", $ticker)
---
SELECT `twitter_streams`.* FROM `twitter_streams` WHERE (stock_name ='AAPL') ORDER BY `twitter_streams`.`updated_at` DESC
SELECT `fb_streams`.* FROM `fb_streams` WHERE (stock_name ='AAPL')

  def historic_data
        stock_data = StockHistoricData.where("stock_tickers =?", $ticker)
        prediction = Prediction_Data.where("stock_tickers =?", $ticker)
---
SELECT `stock_historic_data`.* FROM `stock_historic_data` WHERE (stock_tickers ='GDNEY')
SELECT `prediction_data`.* FROM `prediction_data` WHERE (stock_tickers =NULL)