app/controllers/company_controller.rb

SELECT COUNT(*) FROM `companies`
SELECT COUNT(*) FROM `company`
SELECT  `companies`.* FROM `companies` LIMIT 30 OFFSET 0
SELECT  `company`.* FROM `company` LIMIT 30 OFFSET 0
---
  def index
 	 		@comp = Company.all
 	 		@comp = Company.paginate(:page => params[:page], :per_page => 30)

SELECT COUNT(*) FROM `companies`
SELECT COUNT(*) FROM `company`
SELECT `companies`.* FROM `companies` WHERE (company_name LIKE '%ABT.AX%' OR stock_tickers LIKE '%ABT.AX%')
SELECT `company`.* FROM `company` WHERE (stock_tickers LIKE '%4197.KL%')
SELECT  `companies`.* FROM `companies` LIMIT 30 OFFSET 0
SELECT  `company`.* FROM `company` LIMIT 30 OFFSET 0
---
	def show

		if params[:search]
 	 		@companies = Company.search(params[:search])
  		else
  			@compaies=nil
  			@company= Company.all
		end
		@company = Company.paginate(:page => params[:page], :per_page => 30)