app/controllers/session_controller.rb

    def create
         user = User.find_by(user_email: params[:session][:user_email])
---
SELECT  `users`.* FROM `users` WHERE `users`.`user_email` = 'aiman@gmail' LIMIT 1