app/controllers/user_controller.rb

INSERT INTO `users` (`userFname`, `password_digest`, `user_Cntct`, `user_email`) VALUES ('aiman', '1234', '0172256125', 'aimanaqilahazmi@gmail.com')
---
 def create
    @user= User.new(user_params)
  	@passworddigest =  BCrypt::Password.create @user.password_digest