app/controllers/viewer_controller.rb

SELECT COUNT(*) FROM `companies`
SELECT `companies`.* FROM `companies` ORDER BY updated_at DESC
SELECT  `companies`.* FROM `companies` LIMIT 30 OFFSET 0
---
  def list
  	if params[:search]
		   @company = Company.search(params[:search])
		else
		   @company = Company.all
		   @company = Company.paginate(:page => params[:page], :per_page => 30)